---
kind: method
id: M:Autodesk.Revit.DB.Structure.Rebar.IsRebarShapeDriven
zh: 钢筋、配筋
source: html/b36327e1-c6be-791c-24a5-cf6d02890dee.htm
---
# Autodesk.Revit.DB.Structure.Rebar.IsRebarShapeDriven Method

**中文**: 钢筋、配筋

Returns true if the rebar is shape driven and false if free form.

## Syntax (C#)
```csharp
public bool IsRebarShapeDriven()
```

## Returns
Returns true if the rebar is shape driven and false if free form.